---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MassFailures.OverlappingSolids
source: html/a345a348-5832-254c-b2f0-35d41cba98c8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MassFailures.OverlappingSolids Property

Found volumetric overlap between solids. They will be merged into one

## Syntax (C#)
```csharp
public static FailureDefinitionId OverlappingSolids { get; }
```